app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Faiz"], ["updated_at", "2019-11-26 21:50:05.105746"], ["id", 6]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))